//请注意，以下结构并不一定完全符合游戏设置，仍需进一步的研究
struct R3overseaSaveHeader
{
    /*0x00*/ const char gameMark[0x8];          //DSRASA/0/0
    /*0x08*/ unsigned int OffsetOfSave1;        //0x100
    /*0x0C*/ unsigned int OffsetOfSave2;        //0x8E00
    /*0x10*/ unsigned int checksum;             //?
    /*0x14*/ unsigned int TheNewestSave;        //00-Save1 01-Save2
    //……
};
struct R3overseaMainSave//size 0x8D00
{
    //……
};
struct R3overseaQuickSave//size 0x8D00
{
    //……

};
struct R3overseaSave
{
    /*0x00*/ struct R3overseaSaveHeader R3overseaSaveHeader;
    /*0x100*/ struct R3overseaMainSave R3MainSave1;
    /*0X8E00*/ struct R3overseaMainSave R3MainSave2;
    /*0x11B00*/ struct R3overseaSaveHeader R3QuickSaveHeader; //when used, fill with 00
    /*0x11C00*/ struct R3overseaQuickSave R3QuickSave;
    //每个Mission数据均以gameMark: DSRASA开头
    /*0x1A900*/ const unsigned char Ranger3jpMission1[0x4100];
    /*0x1EA00*/ const unsigned char Ranger3jpMission2[0x4100];
    /*0x22B00*/ const unsigned char Ranger3jpMission3[0x4100];
    /*0x26C00*/ const unsigned char Ranger3jpMission4[0x4100];
    /*0x2AD00*/ const unsigned char Ranger3jpMission5[0x4100];
    /*0x2EE00*/ const unsigned char Ranger3jpMissionUnused[0x4100];
    /*0x32F00*/ const unsigned char Ranger3jpMission6[0x4100];
};

//特殊任务1：守护传说中的蓝色圆球！
const unsigned char Ranger3overseaMission1[0x4100] = 
{
    0x44,0x53,0x52,0x41,0x53,0x41,0x00,0x00,0x00,0xAA,0x01,0x00,0x00,0x00,0x00,0x00,
    0x07,0x51,0x00,0x00,0x00,0x00,0x00,0x00,0xC1,0x02,0x00,0x00,0xFF,0xFF,0xFF,0xFF,
    0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,
    0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,
    0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,
    0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,
    0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,
    0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,
    0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,
    0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,
