//以下结构均为解密后的内容
struct R1Save
{
    /*0x00*/ struct R1JPSaveHeader R1SaveHeader1;
    /*0x200*/ struct R1JPSaveHeader R1SaveHeader2;
    //以下10块内容顺序并不固定，以header里的ChunkIndex顺序排布。(但一般sisikin固定为第一位)
    //这里以siskintsd, wrentsd, hazeltsd, D001, D002, D003, D004的顺序举例
    /*0x400*/ struct siskintsd siskintsd1;
    /*0x2B00*/ struct siskintsd siskintsd2;
    /*0x5200*/ struct wrentsd wrentsd1;
    /*0x8300*/ struct wrentsd wrentsd2;
    /*0xB400*/ struct hazeltsd hazeltsd1;
    /*0xE500*/ struct hazeltsd hazeltsd2;
    /*0x11600*/ struct set_delivery001dat D001;
    /*0x1FE00*/ struct set_delivery003dat D002;
    /*0x26600*/ struct set_delivery002dat D003;
    /*0x2BE00*/ struct set_delivery004dat D004;
    /*0x30E00*/ //For D005-D007
};

/*size:0x30*/
struct ChunkIndex
{
    /*0x00*/ const char chunkName[0x1C];
    /*0x1C*/ unsigned short unknown1;
    /*0x1E*/ unsigned short subChunkCounts;
    /*0x20*/ unsigned int chunkOffset;
    /*0x24*/ const unsigned int dataSize;
    /*0x28*/ const unsigned int chunkSize;
    /*0x2C*/ unsigned int unknown2;
};

/*size:0x200*/
#define R1JP_SAVE_HEADER_SIZE 0x200
struct R1JPSaveHeader
{
    /*0x00*/ const char gameMark[0xC];          //PKR-059/0a00/0
    /*0x0C*/ unsigned int seedOfSaveHeader;
    /*0x10*/ unsigned int crc16OfSaveHeader;    //calculate 0x1EC(0x14-0x200)
    /*0x14*/ unsigned int time;                 //minute,second,hour
    /*0x18*/ unsigned short date;               //year,month,day
    /*0x1A*/ unsigned short saveCounter;
    /*0x1C*/ const int maxChunkCounts;          //10: 3-siskin,wren,hazel; 7-D001~D007 
    /*0x20*/ struct ChunkIndex chunk1_Index;
    /*0x50*/ struct ChunkIndex chunk2_Index;
    /*0x80*/ struct ChunkIndex chunk3_Index;
    /*0xB0*/ struct ChunkIndex chunk4_Index;
    /*0xE0*/ struct ChunkIndex chunk5_Index;
    /*0x110*/ struct ChunkIndex chunk6_Index;
    /*0x140*/ struct ChunkIndex chunk7_Index;
    /*0x170*/ struct ChunkIndex chunk8_Index;
    /*0x1A0*/ struct ChunkIndex chunk9_Index;
    /*0x1D0*/ struct ChunkIndex chunk10_Index;
};

/*size:0x18*/
struct ChunkHeader
{
    /*0x00*/ unsigned int seedOfChunk;
    /*0x04*/ unsigned int crc16OfChunk;         //calculate datasize(0x18-0x****)
    /*0x08*/ unsigned int time;
    /*0x0C*/ unsigned short date;
    /*0x0E*/ unsigned short subChunkNo;
    /*0x10*/ unsigned int saveCounter;
    /*0x14*/ unsigned short chunkEnableFlag;
    /*0x16*/ unsigned short unknown1;
};

//包含巡护员网络信息 datasize:0x260C chunksize:0x4E00
struct siskintsd//无特殊情况，始终位于存档0x400起
{
    /*0x00*/ struct ChunkHeader HeaderOfsiskintsd;
    /*0x18*/ unsigned char TextSpeedFlag;               //?0-slow 1-normal 2-fast
    /*0x19*/ unsigned char unknownFlag2;                //
    /*0x1A*/ unsigned char BorderPatternFlag;           //1~10
    /*0x1B*/ unsigned char LanguageFlag;                //1-jp 2-en 3-fr 4-it 5-de 6-sp
    /*0x1C*/ unsigned char unknownFlag5;
    /*0x1D*/ unsigned char unknownFlag6;
    /*0x1E*/ unsigned char unknownFlag7;
    /*0x1F*/ unsigned char unknownFlag8;
    /*0x20*/ unsigned char ManaphyFlag;                 
            //jp: 0-eggNotRecevied, 1-eggRecevied, 2-eggSent
            //oversea: 0-eggNotRecevied(missionLocked), 1-eggRecevied; 2-eggsent; 3-eggNotRecevied(missionUnlocked)
    /*0x21*/ unsigned char RangerNetAndPasswordFlag;    //only used in oversea version 3-NetOn&PassUsed(notshown)?
    /*0x22*/ unsigned char D001MissionNewFlag:1;        //bit 1-new 0-played
             unsigned char D002MissionNewFlag:1;
             unsigned char D003MissionNewFlag:1;
             unsigned char D004MissionNewFlag:1;
             unsigned char D005MissionNewFlag:1;        //未使用
             unsigned char D006MissionNewFlag:1;        //未使用
             unsigned char D007MissionNewFlag:1;        //未使用
            //日版中所有任务均可同时为new，即0x0F。
            //在海外版中，D001玛娜霏任务通过密码开启，flag独立
            //但D002-D004必须依次完成后开启，故这3个位同一时间最多1个new
    /*0x23*/ unsigned char unknownFlag12;
    /*0x24*/ unsigned int dateOfObtainManaphyEgg;       //year,month,day 
            //Manaphy任务未开启/未配信: ManaphyFlag=0,data=0
            //Manaphy任务已开启,未拿蛋: ManaphyFlag=0,data=0(jp) / ManaphyFlag=3,data=0(oversea)
            //Manaphy任务已开启,已拿蛋: ManaphyFlag=1,data!=0(jp) / ManaphyFlag=1,data!=0(oversea)
            //Manaphy任务已开启,送出蛋: ManaphyFlag=2,data!=0(jp) / ManaphyFlag=2,data!=0(oversea)
    /*0x28*/ unsigned int playerid;
    /*0x2C*/ unsigned int unknown1;
    /*0x30*/ const unsigned char BriefOfD001[0x56C];
    /*0x59C*/ const unsigned char BriefOfD002[0x56C];
    /*0xB08*/ const unsigned char BriefOfD003[0x56C];
    /*0x1074*/ const unsigned char BriefOfD004[0x56C];
    /*0x15E0*/ const unsigned char BriefOfD005[0x56C];//未使用
    /*0x1B4C*/ const unsigned char BriefOfD006[0x56C];//未使用
    /*0x20B8*/ const unsigned char BriefOfD007[0x56C];//未使用
            //日版需通过配信获得BriefD001~D004
            //海外版建档时根据语言版本自动写入对应语言的BriefOfD001~D004
    /*0x2624-0x2700*/ //填充0xFF
};

//包含玩家信息 datasize:0x30D4 chunksize:0x6200
struct wrentsd
{
    /*0x00*/ struct ChunkHeader HeaderOfwrentsd;
    /*0x18*/ //other data
};

//中断的临时存档 datasize:0x30D4 chunksize:0x6200
struct hazeltsd
{
    /*0x00*/ struct ChunkHeader HeaderOfhazeltsd;
    /*0x18*/ //other data
};

//D001 datasize:0xE7E8 chunksize:0xE800 //chunksize = headersize + datasize
struct set_delivery001dat
{
    /*0x00*/ struct ChunkHeader HeaderOfset_delivery001dat;
    /*0x18*/ //other data
};

//D002 datasize:0x67E8 chunksize:0x6800 //chunksize = headersize + datasize
struct set_delivery003dat
{
    /*0x00*/ struct ChunkHeader HeaderOfset_delivery003dat;
    /*0x18*/ //other data
};

//D003 datasize:0x57E8 chunksize:0x5800 //chunksize = headersize + datasize
struct set_delivery002dat
{
    /*0x00*/ struct ChunkHeader HeaderOfset_delivery002dat;
    /*0x18*/ //other data
};

//D004 datasize:0x4FE8 chunksize:0x5000 //chunksize = headersize + datasize
struct set_delivery004dat
{
    /*0x00*/ struct ChunkHeader HeaderOfset_delivery004dat;
    /*0x18*/ //other data
};

const unsigned char SaveHeaderOfD001[0x30] =
{
    0x73,0x65,0x74,0x5F,0x64,0x65,0x6C,0x69,0x76,0x65,0x72,0x79,0x30,0x30,0x31,0x2E,
    0x64,0x61,0x74,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x00,
    0x00,0x00,0x00,0x00,0xE8,0xE7,0x00,0x00,0x00,0xE8,0x00,0x00,0x00,0x00,0x00,0x00
};

const unsigned char SaveHeaderOfD002[0x30] =
{
    0x73,0x65,0x74,0x5F,0x64,0x65,0x6C,0x69,0x76,0x65,0x72,0x79,0x30,0x30,0x33,0x2E,
    0x64,0x61,0x74,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x00,
    0x00,0x00,0x00,0x00,0xE8,0x67,0x00,0x00,0x00,0x68,0x00,0x00,0x00,0x00,0x00,0x00
};

const unsigned char SaveHeaderOfD003[0x30] =
{
    0x73,0x65,0x74,0x5F,0x64,0x65,0x6C,0x69,0x76,0x65,0x72,0x79,0x30,0x30,0x32,0x2E,
    0x64,0x61,0x74,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x00,
